# St7GetBeamShrink

Returns a percentage by which to shrink the display of beam elements.

long St7GetBeamShrink(long uID, long* Shrink)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Shrink

The Shrink percentage in the range kMinShrink to kMaxShrink.

Strand7 API Manual

Plate Entity Display